IDENTIFICATION DIVISION.
PROGRAM-ID. HANSOLO-GENERATOR.
DATA DIVISION.
FILE SECTION.
FD HANSOLO-FILE.
01 HANSOLO-REC PIC X(7).
WORKING-STORAGE SECTION.
01 COUNTER PIC 9(6) VALUE 0.
PROCEDURE DIVISION.
MAIN-PARA.
    OPEN OUTPUT HANSOLO-FILE.
    PERFORM UNTIL COUNTER = 1000000
        MOVE "HANSOLO" TO HANSOLO-REC
        WRITE HANSOLO-REC
        ADD 1 TO COUNTER
    END-PERFORM.
    CLOSE HANSOLO-FILE.
    STOP RUN.
